In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
import csv 
data = pd.read_csv("LGD_DATA.csv")

In [6]:
df = pd.DataFrame(data)
df.head()

,Ac_No,Age,Years of Experience,Number of Vehicles,Gender,Married,Losses in Thousands
0,150024,24,5,1,M,Married,203.319595
1,144880,31,10,1,F,Single,402.197302
2,133742,56,37,1,M,Married,553.132096
3,151282,52,31,1,F,Married,292.430579
4,174407,20,3,1,M,Single,246.540576

In [7]:
df_new = pd.get_dummies(df,drop_first=True)
df_new.head()

,Ac_No,Age,Years of Experience,Number of Vehicles,Losses in Thousands,Gender_M,Married_Single
0,150024,24,5,1,203.319595,1,0
1,144880,31,10,1,402.197302,0,1
2,133742,56,37,1,553.132096,1,0
3,151282,52,31,1,292.430579,0,0
4,174407,20,3,1,246.540576,1,1

In [8]:
df1 = df.drop(['Ac_No'], axis=1)

In [9]:
df1.head()

,Age,Years of Experience,Number of Vehicles,Gender,Married,Losses in Thousands
0,24,5,1,M,Married,203.319595
1,31,10,1,F,Single,402.197302
2,56,37,1,M,Married,553.132096
3,52,31,1,F,Married,292.430579
4,20,3,1,M,Single,246.540576

In [10]:
from sklearn.linear_model import LinearRegression

In [22]:
linreg=LinearRegression()
linreg.fit(df_new.iloc[:,[1,2,3,5,6]],df_new['Losses in Thousands'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [26]:
df_new['PredictedLoss']=linreg.predict(df_new.iloc[:,[1,2,3,5,6]])

In [27]:
linreg.intercept_

502.9204833236396

In [29]:
linreg.coef_

array([ -3.80823766,  -2.43254505,  -2.69086413,  93.8563901 ,
       134.99809835])

In [30]:
TSS = sum((df_new['Losses in Thousands']-np.mean(df_new['PredictedLoss']))**2)
SSE = sum((df_new['Losses in Thousands']-df_new['PredictedLoss'])**2)

In [31]:
R2 = 1-(SSE/TSS)
print(R2)

0.3019844936813971

In [ ]:
#Loss in Thousands = 502.9 - 3.80*Age -2.43*yearofexp -2.69*no. of vehicles + 93.85*male + 134.99*single